Revit 2021.1 API
RevisionSettings.GetNumericRevisionSettings Method
 Returns a copy of the NumericRevisionSettings owned by this RevisionSettings object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2016
Syntax
C#
public NumericRevisionSettings GetNumericRevisionSettings()
Visual Basic
Public Function GetNumericRevisionSettings As NumericRevisionSettings
Visual C++
public:
NumericRevisionSettings^ GetNumericRevisionSettings()
Return Value
 The copy of the NumericRevisionSettings owned by this RevisionSettings object.
See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace